#pragma once
#include "common.h"

// ===============================================
// Створення прототипів функцій для роботи з полем
// ===============================================


// -------------------------------------
// Ініціалізація поля (заповнення водою)
// -------------------------------------
void initBoard(char board[BOARD_SIZE][BOARD_SIZE]);

// --------------------
// Вивід полів на екран
// --------------------
void printBoard(char pBoard[BOARD_SIZE][BOARD_SIZE], char cBoard[BOARD_SIZE][BOARD_SIZE]);