#pragma once
#include "common.h"

// ===========================
// Основні логічні функції гри
// ===========================


// --------------------------------------
// Перевірка чи вільне місце під корабель
// --------------------------------------
bool canPlaceShip(char board[BOARD_SIZE][BOARD_SIZE], int x, int y, int size, bool horizontal);

// --------------------------------
// Автоматична розстановка кораблів
// --------------------------------
void placeShipsAuto(char board[BOARD_SIZE][BOARD_SIZE]);

// --------------------------------------
// Перевірка чи можна стреляти в клітинку
// --------------------------------------
bool canShoot(char board[BOARD_SIZE][BOARD_SIZE], int x, int y);

// -------------------------------------------------
// Обробка удару та повернення true у разі попадання
// -------------------------------------------------
bool processShot(char board[BOARD_SIZE][BOARD_SIZE], int x, int y);

// --------------------------------
// Перевірка чи затоплений корабель
// --------------------------------
bool isSunk(char board[BOARD_SIZE][BOARD_SIZE], int x, int y);

// ------------------------------------------------
// Замальовування клітинок біля затопленого корабля
// ------------------------------------------------
void markAroundSunk(char board[BOARD_SIZE][BOARD_SIZE], int x, int y);

// -------------------
// Перевірка на виграш
// -------------------
bool checkWin(char board[BOARD_SIZE][BOARD_SIZE]);